print("🧮 حل مسائل الرياضيات باللغة العربية")

print("اختر العملية:")
print("1 - جمع")
print("2 - طرح")
print("3 - ضرب")
print("4 - قسمة")

choice = input("اكتب رقم العملية: ")

a = float(input("ادخل الرقم الأول: "))
b = float(input("ادخل الرقم الثاني: "))

if choice == "1":
    print("الناتج =", a + b)
elif choice == "2":
    print("الناتج =", a - b)
elif choice == "3":
    print("الناتج =", a * b)
elif choice == "4":
    if b != 0:
        print("الناتج =", a / b)
    else:
        print("لا يمكن القسمة على صفر")
else:
    print("اختيار غير صحيح")
